//21.Ввести першу літеру назви річки і вивести довідку про її довжину і
//кількість приток
#include <iostream>

int main() {

  std::cout << "Натисніть цифру 1 щоб дізнатися першу букву річки Дніпро, цифру 2 щоб дізнатися її довжину,цифру 3 щоб дізнатися скільки приток у Дніпра!\n";
  int x = 0;
  std::cin >> x;

  switch (x) {
  case 1:
    std::cout << "Д";
    break;
  case 2:
    std::cout << "2 201 км";
    break;
  case 3:
    std::cout << "Основні притоки дніпра: Березина, Прип’ять (річка), Тетерів, Рось, Інгулець, Сож, Десна (притока Дніпра), Сула, Псел, Ворскла (річка), Оріль, Самара (річка) , всього їх 12";
    break;
 
  }
}
